Console.WriteLine("Task 25");
// Напишите цикл, который принимает на вход два числа (А и В) и возводит
// число А в натуральную степень В.
// 3, 5 -> 243 (3^5)       2, 4 -> 16



Console.WriteLine("\nTask 27");
// Напишите программу, котора принимает на вход число и выдает сумму цифр в числе.
// 452 -> 11       82 -> 10        9012 -> 12



Console.WriteLine("\nTask 29");
// Напишите программу, котора язадает массив из 8 элементов и выводит их на экран.
// 1, 2, 5, 7, 19 -> [1, 2, 5, 8, 19]
// 6, 1, 33 -> [6, 1, 33]